---
kind: method
id: M:Autodesk.Revit.ApplicationServices.Application.UpdateRenderAppearanceLibrary
source: html/2898f4d5-63f5-5ff8-022b-724e702464b9.htm
---
# Autodesk.Revit.ApplicationServices.Application.UpdateRenderAppearanceLibrary Method

Updates the stored render appearance library, giving the Revit session access to any new RPC content.

## Syntax (C#)
```csharp
public void UpdateRenderAppearanceLibrary()
```